In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame(
    {

    'City': [
        'Mumbai', 'Pune', 'Delhi', 'Bangalore', 'Hyderabad',
        'Chennai', 'Kolkata', 'Jaipur', 'Ahmedabad', 'Surat',
        'Nagpur', 'Indore', 'Lucknow', 'Patna', 'Bhopal',
        'Vadodara', 'Coimbatore', 'Chandigarh', 'Nashik', 'Rajkot'
    ],
    'Price': [
        9500000, 7200000, 8800000, 9300000, 8500000,
        8100000, 7800000, 6700000, 7400000, 7100000,
        6600000, 6900000, 7300000, 6400000, 7000000,
        6800000, 7500000, 7700000, 7000000, 6900000
    ]
}
    
)

In [3]:
df

          City    Price
0       Mumbai  9500000
1         Pune  7200000
2        Delhi  8800000
3    Bangalore  9300000
4    Hyderabad  8500000
5      Chennai  8100000
6      Kolkata  7800000
7       Jaipur  6700000
8    Ahmedabad  7400000
9        Surat  7100000
10      Nagpur  6600000
11      Indore  6900000
12     Lucknow  7300000
13       Patna  6400000
14      Bhopal  7000000
15    Vadodara  6800000
16  Coimbatore  7500000
17  Chandigarh  7700000
18      Nashik  7000000
19      Rajkot  6900000

In [10]:
meain_price=df.groupby('City')['Price'].mean().to_dict()

In [11]:
meain_price

{'Ahmedabad': 7400000.0,
 'Bangalore': 9300000.0,
 'Bhopal': 7000000.0,
 'Chandigarh': 7700000.0,
 'Chennai': 8100000.0,
 'Coimbatore': 7500000.0,
 'Delhi': 8800000.0,
 'Hyderabad': 8500000.0,
 'Indore': 6900000.0,
 'Jaipur': 6700000.0,
 'Kolkata': 7800000.0,
 'Lucknow': 7300000.0,
 'Mumbai': 9500000.0,
 'Nagpur': 6600000.0,
 'Nashik': 7000000.0,
 'Patna': 6400000.0,
 'Pune': 7200000.0,
 'Rajkot': 6900000.0,
 'Surat': 7100000.0,
 'Vadodara': 6800000.0}

In [13]:
df['city_encoded']=df['City'].map(meain_price)

In [15]:
df[['Price','city_encoded']]

      Price  city_encoded
0   9500000     9500000.0
1   7200000     7200000.0
2   8800000     8800000.0
3   9300000     9300000.0
4   8500000     8500000.0
5   8100000     8100000.0
6   7800000     7800000.0
7   6700000     6700000.0
8   7400000     7400000.0
9   7100000     7100000.0
10  6600000     6600000.0
11  6900000     6900000.0
12  7300000     7300000.0
13  6400000     6400000.0
14  7000000     7000000.0
15  6800000     6800000.0
16  7500000     7500000.0
17  7700000     7700000.0
18  7000000     7000000.0
19  6900000     6900000.0

In [16]:
import seaborn as sns
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]